numpy.org
:PROPERTIES:
:ID:       a3134371-c437-4772-ab5e-9fd3e23aa653
:ROAM_ALIASES: numpy
:END:
#+title: Numpy

* Loading Numpy
#+begin_src python :session np :exports none
import numpy as np
#+end_src

#+RESULTS:

* Built-in methods to create arrays
** ~array~
#+begin_src python :session np :exports both
np.array([[1,2,3],[4,5,6],[7,8,9]])
#+end_src

#+RESULTS:
| 1 | 2 | 3 |
| 4 | 5 | 6 |
| 7 | 8 | 9 |

** ~arange~
#+begin_src python :session np :exports both
np.arange(0, 11, 2)
#+end_src

#+RESULTS:
| 0 | 2 | 4 | 6 | 8 | 10 |

** ~zeros~, ~ones~
#+begin_src python :session np :exports both
np.zeros((5, 5))
#+end_src

#+RESULTS:
| 0 | 0 | 0 | 0 | 0 |
| 0 | 0 | 0 | 0 | 0 |
| 0 | 0 | 0 | 0 | 0 |
| 0 | 0 | 0 | 0 | 0 |
| 0 | 0 | 0 | 0 | 0 |

** ~linspace~
Return ~n~ evenly spaced numbers over ~[a, b]~ (both inclusive).
#+begin_src python :session np :exports both
np.linspace(0, 5, 11)
#+end_src

#+RESULTS:
| 0 | 0.5 | 1 | 1.5 | 2 | 2.5 | 3 | 3.5 | 4 | 4.5 | 5 |

** ~eye~
Creates an identity matrix.
#+begin_src python :session np :exports both
np.eye(4)
#+end_src

#+RESULTS:
| 1 | 0 | 0 | 0 |
| 0 | 1 | 0 | 0 |
| 0 | 0 | 1 | 0 |
| 0 | 0 | 0 | 1 |

* Random
** ~seed~
#+begin_src python :session np :exports both
np.random.seed(42)
np.random.rand(4)
#+end_src

#+RESULTS:
| 0.37454012 | 0.95071431 | 0.73199394 | 0.59865848 |

** ~rand~
Creates an array of the given shape populated with random samples from a
*uniform distribution* over [0, 1].
#+begin_src python :session np :exports both
np.random.rand(5,5)
#+end_src

#+RESULTS:
| 0.15601864 | 0.15599452 | 0.05808361 | 0.86617615 | 0.60111501 |
| 0.70807258 | 0.02058449 | 0.96990985 | 0.83244264 | 0.21233911 |
| 0.18182497 | 0.18340451 | 0.30424224 | 0.52475643 | 0.43194502 |
| 0.29122914 | 0.61185289 | 0.13949386 | 0.29214465 | 0.36636184 |
| 0.45606998 | 0.78517596 | 0.19967378 | 0.51423444 | 0.59241457 |

** ~randn~
Uses the *standard distribution* (σ = 1) to populate the array.
#+begin_src python :session np :exports both
np.random.randn(2)
#+end_src

#+RESULTS:
| 0.291034 | -0.63555974 |

** ~randint~
Returns random integers from ~low~ (inclusive) to ~high~ (exclusive).
#+begin_src python :session np :exports both :results both
np.random.randint(0, 100)
#+end_src

#+RESULTS:
: 59

#+begin_src python :session np :exports both :results both
np.random.randint(0, 10, 9)
#+end_src

#+RESULTS:
| 6 | 7 | 2 | 0 | 3 | 1 | 7 | 3 | 1 |

* Array attributes and methods
** ~reshape~
(~rows~, ~columns~)
#+begin_src python :session np :exports both
np.arange(0, 25).reshape(5, 5)
#+end_src

#+RESULTS:
|  0 |  1 |  2 |  3 |  4 |
|  5 |  6 |  7 |  8 |  9 |
| 10 | 11 | 12 | 13 | 14 |
| 15 | 16 | 17 | 18 | 19 |
| 20 | 21 | 22 | 23 | 24 |

** ~min~, ~max~, ~argmin~, ~argmax~
#+begin_src python :session np :exports both
arr = np.random.randint(0, 100, 10)
arr
#+end_src

#+RESULTS:
| 5 | 53 | 3 | 53 | 92 | 62 | 17 | 89 | 43 | 33 |

Get maximum value.
#+begin_src python :session np :exports both
arr.max()
#+end_src

#+RESULTS:
: 92

Get minimum value.
#+begin_src python :session np :exports both
arr.min()
#+end_src

#+RESULTS:
: 3

Get index of the maximum value.
#+begin_src python :session np :exports both
arr.argmax()
#+end_src

#+RESULTS:
: 4

Get index of the minimum value.
#+begin_src python :session np :exports both
arr.argmin()
#+end_src

#+RESULTS:
: 2

** ~shape~
~(rows, columns, ...)~
Each element in a numpy array is a row. However, when
displayed, it is represented horizontally. It is better to think of it as
vertical.
#+begin_src python :session np :exports both
np.arange(0, 25).shape
#+end_src

#+RESULTS:
| 25 |

** ~ndim~
#+begin_src python :session np :exports both
np.arange(0, 125).reshape(5, 5, 5).ndim
#+end_src

#+RESULTS:
: 3

** ~dtype~
#+begin_src python :session np :exports both
arr = np.arange(0, 25, dtype='float16') # intx, uintx, floatx
arr.dtype
#+end_src

#+RESULTS:
: float16

** ~size~
Returns the length of the array.
#+begin_src python :session np :exports both
a = np.array([3, 1, 5, 2, 5, 1, 1, 5, 1, 4, 2, 1, 4, 5])
a.size
#+end_src

#+RESULTS:
: 14

** ~itemsize~
Number of bytes that the underlying data type requires to store one element.
#+begin_src python :session np :exports both
np.array([1, 2, 3], dtype=np.uint64).itemsize
#+end_src

#+RESULTS:
: 8

* Indexing and slicing
