numpy.org
** Slicing 1-D
Regular slicing methods used in lists apply. Slice will point to the original
arrays memory, which is not the case in regular lists.
#+begin_src python :session np :exports both
l1 = list(range(0, 10))
l2 = l1[:5] # [:] operator shallow copies elements to a new array
l1[1] = 100
l2
#+end_src

#+RESULTS:
| 0 | 1 | 2 | 3 | 4 |

#+begin_src python :session np :exports both
a1 = np.arange(0, 10)
a2 = a1[:5]
a1[1] = 100
a2
#+end_src

#+RESULTS:
| 0 | 100 | 2 | 3 | 4 |

** ~copy~
#+begin_src python :session np :exports both
a1 = np.arange(0, 10)
a2 = a1[:5].copy()
a1[1] = 100
a2
#+end_src

#+RESULTS:
| 0 | 1 | 2 | 3 | 4 |

** Broadcasting
#+begin_src python :session np :exports both
arr = np.arange(0, 10)
arr[:5] = 100
arr
#+end_src

#+RESULTS:
| 100 | 100 | 100 | 100 | 100 | 5 | 6 | 7 | 8 | 9 |

** Slicing 2-D
Using ~:~ is important when slicing. It changes the shape of the output. Using
~:~ keeps the shape.
#+begin_src python :session np :exports both
a = np.arange(0, 100, 5).reshape(4, 5)
a
#+end_src

#+RESULTS:
|  0 |  5 | 10 | 15 | 20 |
| 25 | 30 | 35 | 40 | 45 |
| 50 | 55 | 60 | 65 | 70 |
| 75 | 80 | 85 | 90 | 95 |

#+begin_src python :session np :exports both
a[1:3]
#+end_src

#+RESULTS:
| 25 | 30 | 35 | 40 | 45 |
| 50 | 55 | 60 | 65 | 70 |

#+begin_src python :session np :exports both
a[1:3,2:]
#+end_src

#+RESULTS:
| 35 | 40 | 45 |
| 60 | 65 | 70 |

#+begin_src python :session np :exports both
a[1:, 3:4] # != a[1:, 3]
#+end_src

#+RESULTS:
| 40 |
| 65 |
| 90 |

#+begin_src python :session np :exports both
a[1:, 3]
#+end_src

#+RESULTS:
| 40 | 65 | 90 |

* Conditional selection
Includes a pointer to the original array.
#+begin_src python :session np :exports both
a = np.random.randint(0, 10, 20)
a
#+end_src

#+RESULTS:
| 9 | 3 | 7 | 6 | 8 | 7 | 4 | 1 | 4 | 7 | 9 | 8 | 8 | 0 | 8 | 6 | 8 | 7 | 0 | 7 |

#+begin_src python :session np :exports both
gt5 = a > 5
a[gt5]
#+end_src

#+RESULTS:
| 9 | 7 | 6 | 8 | 7 | 7 | 9 | 8 | 8 | 8 | 6 | 8 | 7 | 7 |

#+begin_src python :session np :exports both
a[gt5] *= 10
a
#+end_src

#+RESULTS:
| 90 | 3 | 70 | 60 | 80 | 70 | 4 | 1 | 4 | 70 | 90 | 80 | 80 | 0 | 80 | 60 | 80 | 70 | 0 | 70 |

* Operations
** ~+~, ~-~, ~/~, ~*~
Division by zero will not cause an error. Instead it will issue a warning.
#+begin_src python :session np :exports both
a = np.array([5, 7, 1, 0])
a / 2
#+end_src

#+RESULTS:
| 2.5 | 3.5 | 0.5 | 0 |

#+begin_src python :session np :exports both
a / a
#+end_src

#+RESULTS:
| 1 | 1 | 1 | nan |

#+begin_src python :session np :exports both
a / 0
#+end_src

#+RESULTS:
| inf | inf | inf | nan |

* Data types
** Numpy data types
Here are some of the types that numpy supports. Consult the documentation for
more information.
| Data type                                                       | Description            |
|-----------------------------------------------------------------+------------------------|
| ~bool_~, ~bool8~                                                | Boolean                |
| ~int_~, ~intc~, ~intp~, ~int8~, ~int16~, ~int32~, ~int64~       | Integer types          |
| ~uint~, ~uintc~, ~uintp~, ~uint8~, ~uint16~, ~uint32~, ~uint64~ | Unsigned integer types |
| ~float_~, ~float16~, ~float32~, ~float64~                       | Float types            |
| ~complex_~, ~complex64~, ~complex128~                           | Complex types          |
** Constructing with data type
#+begin_src python :session np :exports both :results pp
np.array([1, 2, 3, 4, 5], dtype=np.float16)
#+end_src

#+RESULTS:
: array([1., 2., 3., 4., 5.], dtype=float16)

