numpy.md


<a id="org88ed2ef"></a>

## Slicing 1-D

Regular slicing methods used in lists apply. Slice will point to the original
arrays memory, which is not the case in regular lists.

    l1 = list(range(0, 10))
    l2 = l1[:5] # [:] operator shallow copies elements to a new array
    l1[1] = 100
    l2

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
</tr>
</tbody>
</table>

    a1 = np.arange(0, 10)
    a2 = a1[:5]
    a1[1] = 100
    a2

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">100</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
</tr>
</tbody>
</table>


<a id="org23327fd"></a>

## `copy`

    a1 = np.arange(0, 10)
    a2 = a1[:5].copy()
    a1[1] = 100
    a2

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
</tr>
</tbody>
</table>


<a id="org64adf85"></a>

## Broadcasting

    arr = np.arange(0, 10)
    arr[:5] = 100
    arr

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">5</td>
<td class="org-right">6</td>
<td class="org-right">7</td>
<td class="org-right">8</td>
<td class="org-right">9</td>
</tr>
</tbody>
</table>


<a id="orge6f337b"></a>

## Slicing 2-D

Using `:` is important when slicing. It changes the shape of the output. Using
`:` keeps the shape.

    a = np.arange(0, 100, 5).reshape(4, 5)
    a

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">5</td>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">20</td>
</tr>


<tr>
<td class="org-right">25</td>
<td class="org-right">30</td>
<td class="org-right">35</td>
<td class="org-right">40</td>
<td class="org-right">45</td>
</tr>


<tr>
<td class="org-right">50</td>
<td class="org-right">55</td>
<td class="org-right">60</td>
<td class="org-right">65</td>
<td class="org-right">70</td>
</tr>


<tr>
<td class="org-right">75</td>
<td class="org-right">80</td>
<td class="org-right">85</td>
<td class="org-right">90</td>
<td class="org-right">95</td>
</tr>
</tbody>
</table>

    a[1:3]

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">25</td>
<td class="org-right">30</td>
<td class="org-right">35</td>
<td class="org-right">40</td>
<td class="org-right">45</td>
</tr>


<tr>
<td class="org-right">50</td>
<td class="org-right">55</td>
<td class="org-right">60</td>
<td class="org-right">65</td>
<td class="org-right">70</td>
</tr>
</tbody>
</table>

    a[1:3,2:]

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">35</td>
<td class="org-right">40</td>
<td class="org-right">45</td>
</tr>


<tr>
<td class="org-right">60</td>
<td class="org-right">65</td>
<td class="org-right">70</td>
</tr>
</tbody>
</table>

    a[1:, 3:4] # != a[1:, 3]

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">40</td>
</tr>


<tr>
<td class="org-right">65</td>
</tr>


<tr>
<td class="org-right">90</td>
</tr>
</tbody>
</table>

    a[1:, 3]

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">40</td>
<td class="org-right">65</td>
<td class="org-right">90</td>
</tr>
</tbody>
</table>


<a id="orgd91c216"></a>

# Conditional selection

Includes a pointer to the original array.

    a = np.random.randint(0, 10, 20)
    a

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">3</td>
<td class="org-right">1</td>
<td class="org-right">7</td>
<td class="org-right">3</td>
<td class="org-right">1</td>
<td class="org-right">5</td>
<td class="org-right">5</td>
<td class="org-right">9</td>
<td class="org-right">3</td>
<td class="org-right">5</td>
<td class="org-right">1</td>
<td class="org-right">9</td>
<td class="org-right">1</td>
<td class="org-right">9</td>
<td class="org-right">3</td>
<td class="org-right">7</td>
<td class="org-right">6</td>
<td class="org-right">8</td>
<td class="org-right">7</td>
</tr>
</tbody>
</table>

    gt5 = a > 5
    a[gt5]

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">7</td>
<td class="org-right">9</td>
<td class="org-right">9</td>
<td class="org-right">9</td>
<td class="org-right">7</td>
<td class="org-right">6</td>
<td class="org-right">8</td>
<td class="org-right">7</td>
</tr>
</tbody>
</table>

    a[gt5] *= 10
    a

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">3</td>
<td class="org-right">1</td>
<td class="org-right">70</td>
<td class="org-right">3</td>
<td class="org-right">1</td>
<td class="org-right">5</td>
<td class="org-right">5</td>
<td class="org-right">90</td>
<td class="org-right">3</td>
<td class="org-right">5</td>
<td class="org-right">1</td>
<td class="org-right">90</td>
<td class="org-right">1</td>
<td class="org-right">90</td>
<td class="org-right">3</td>
<td class="org-right">70</td>
<td class="org-right">60</td>
<td class="org-right">80</td>
<td class="org-right">70</td>
</tr>
</tbody>
</table>


<a id="org0af7154"></a>

# Operations


<a id="org4ec5a77"></a>

## `+`, `-`, `/`, `*`

Division by zero will not cause an error. Instead it will issue a warning.

    a = np.array([5, 7, 1, 0])
    print(a / 2)

    [2.5 3.5 0.5 0. ]

    print(a / a)

    [ 1.  1.  1. nan]

    print(a / 0)

    [inf inf inf nan]


<a id="org789f7ed"></a>

# Data types


<a id="orgae9e9bf"></a>

## Numpy data types

Here are some of the types that numpy supports. Consult the documentation for
more information.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Data type</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left"><code>bool_</code>, <code>bool8</code></td>
<td class="org-left">Boolean</td>
</tr>


<tr>
<td class="org-left"><code>int_</code>, <code>intc</code>, <code>intp</code>, <code>int8</code>, <code>int16</code>, <code>int32</code>, <code>int64</code></td>
<td class="org-left">Integer types</td>
</tr>


<tr>
<td class="org-left"><code>uint</code>, <code>uintc</code>, <code>uintp</code>, <code>uint8</code>, <code>uint16</code>, <code>uint32</code>, <code>uint64</code></td>
<td class="org-left">Unsigned integer types</td>
</tr>


<tr>
<td class="org-left"><code>float_</code>, <code>float16</code>, <code>float32</code>, <code>float64</code></td>
<td class="org-left">Float types</td>
</tr>


<tr>
<td class="org-left"><code>complex_</code>, <code>complex64</code>, <code>complex128</code></td>
<td class="org-left">Complex types</td>
</tr>
</tbody>
</table>


<a id="org4255104"></a>

## Constructing with data type

    np.array([1, 2, 3, 4, 5], dtype=np.float16)

    array([1., 2., 3., 4., 5.], dtype=float16)
