numpy.org
** Structured arrays
Structured arrays are ndarrays whose datatype is a composition of simpler
datatypes organized as a sequence of named fields. They closely mimic C ~struct~ for low-level manipulation and interpretation of binary blobs.

1. A list of tuples can be used to express the layout.
   ~np.dtype([(fieldname, datatype, shape), ...])~ where ~shape~ is optional.
2. A string of comma-seperated dtype specifications.
#+begin_src python :session np :exports both :results pp
np.dtype('i8, f4, S3')
#+end_src

#+RESULTS:
: dtype([('f0', '<i8'), ('f1', '<f4'), ('f2', 'S3')])

3. A dictionary of field parameter arrays. This is the most flexible option.
   * ~names~, ~formats~ have to be specified and must be of the same length.
   * ~offsets~ specifies the offset of each column from the start.
   * ~itemsize~ specifies the total size of the structure. It must be able to
     contain the structure.
#+begin_src python :session np :exports both :results pp
# np.dtype({'names': ['col1', 'col2'], 'formats': ['i4', 'f4']})
np.dtype({'names':   ['col1', 'col2'],
          'formats': ['i4',   'f4'],
          'offsets': [0,      4],
          'itemsize': 12})
#+end_src

#+RESULTS:
: dtype({'names': ['col1', 'col2'], 'formats': ['<i4', '<f4'], 'offsets': [0, 4], 'itemsize': 12})

4. A dictionary of field names.
#+begin_src python :session np :exports both :results pp
np.dtype({'col1': ('i1', 0), 'col2': ('f4', 1)})
#+end_src

#+RESULTS:
: dtype([('col1', 'i1'), ('col2', '<f4')])

Here is a table called ~population~.
#+tblname: population_table
| Netherlands    | 393 |  41526 | 16928800 |
| Belgium        | 337 |  30510 | 11007020 |
| United Kingdom | 256 | 243610 | 62262000 |
| Germany        | 233 | 357021 | 81799600 |
| Liechtenstein  | 205 |    160 |    32842 |
| Italy          | 192 | 301230 | 59715625 |
| Switzerland    | 177 |  41290 |  7301994 |
| Luxembourg     | 173 |   2586 |   512000 |
| France         | 111 | 547030 | 63601002 |
| Austria        |  97 |  83858 |  8169929 |
| Greece         |  81 | 131940 | 11606813 |
| Ireland        |  65 |  70280 |  4581269 |
| Sweden         |  20 | 449964 |  9515744 |
| Finland        |  16 | 338424 |  5410233 |
| Norway         |  13 | 385252 |  5033675 |

#+begin_src python :session np :exports both :var population=population_table :results pp
population = list((*l,) for l in population)
pop_t = np.dtype([('country', 'U20'), ('density', '=i4'), ('area', '=i4'), ('population', '=i4')])
np.array(population, dtype=pop_t)
#+end_src

#+RESULTS:
#+begin_example
array([('Netherlands', 393,  41526, 16928800),
       ('Belgium', 337,  30510, 11007020),
       ('United Kingdom', 256, 243610, 62262000),
       ('Germany', 233, 357021, 81799600),
       ('Liechtenstein', 205,    160,    32842),
       ('Italy', 192, 301230, 59715625),
       ('Switzerland', 177,  41290,  7301994),
       ('Luxembourg', 173,   2586,   512000),
       ('France', 111, 547030, 63601002),
       ('Austria',  97,  83858,  8169929),
       ('Greece',  81, 131940, 11606813),
       ('Ireland',  65,  70280,  4581269),
       ('Sweden',  20, 449964,  9515744),
       ('Finland',  16, 338424,  5410233),
       ('Norway',  13, 385252,  5033675)],
      dtype=[('country', '<U20'), ('density', '<i4'), ('area', '<i4'), ('population', '<i4')])
#+end_example

** Endiannes
- ~<i8~ use little-endian. x86 architecture and some Arm chips use this
  format.
- ~>i8~ use big-endian. This format should be used when transmitting data over
  a network.
- ~=i8~ use native-endiannes of the system. It is system-dependant, so
  shouldn't be use accross systems.
