numpy.md


<a id="org97f64ba"></a>

## Structured arrays

Structured arrays are ndarrays whose datatype is a composition of simpler
datatypes organized as a sequence of named fields. They closely mimic C `struct` for low-level manipulation and interpretation of binary blobs.

1.  A list of tuples can be used to express the layout.
    `np.dtype([(fieldname, datatype, shape), ...])` where `shape` is optional.
2.  A string of comma-seperated dtype specifications.

    np.dtype('i8, f4, S3')

    dtype([('f0', '<i8'), ('f1', '<f4'), ('f2', 'S3')])

1.  A dictionary of field parameter arrays. This is the most flexible option.
    -   `names`, `formats` have to be specified and must be of the same length.
    -   `offsets` specifies the offset of each column from the start.
    -   `itemsize` specifies the total size of the structure. It must be able to
        contain the structure.

    # np.dtype({'names': ['col1', 'col2'], 'formats': ['i4', 'f4']})
    np.dtype({'names':   ['col1', 'col2'],
              'formats': ['i4',   'f4'],
              'offsets': [0,      4],
              'itemsize': 12})

    dtype({'names': ['col1', 'col2'], 'formats': ['<i4', '<f4'], 'offsets': [0, 4], 'itemsize': 12})

1.  A dictionary of field names.

    np.dtype({'col1': ('i1', 0), 'col2': ('f4', 1)})

    dtype([('col1', 'i1'), ('col2', '<f4')])

Here is a table called `population`.

<table id="org04b9cbc" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Netherlands</td>
<td class="org-right">393</td>
<td class="org-right">41526</td>
<td class="org-right">16928800</td>
</tr>


<tr>
<td class="org-left">Belgium</td>
<td class="org-right">337</td>
<td class="org-right">30510</td>
<td class="org-right">11007020</td>
</tr>


<tr>
<td class="org-left">United Kingdom</td>
<td class="org-right">256</td>
<td class="org-right">243610</td>
<td class="org-right">62262000</td>
</tr>


<tr>
<td class="org-left">Germany</td>
<td class="org-right">233</td>
<td class="org-right">357021</td>
<td class="org-right">81799600</td>
</tr>


<tr>
<td class="org-left">Liechtenstein</td>
<td class="org-right">205</td>
<td class="org-right">160</td>
<td class="org-right">32842</td>
</tr>


<tr>
<td class="org-left">Italy</td>
<td class="org-right">192</td>
<td class="org-right">301230</td>
<td class="org-right">59715625</td>
</tr>


<tr>
<td class="org-left">Switzerland</td>
<td class="org-right">177</td>
<td class="org-right">41290</td>
<td class="org-right">7301994</td>
</tr>


<tr>
<td class="org-left">Luxembourg</td>
<td class="org-right">173</td>
<td class="org-right">2586</td>
<td class="org-right">512000</td>
</tr>


<tr>
<td class="org-left">France</td>
<td class="org-right">111</td>
<td class="org-right">547030</td>
<td class="org-right">63601002</td>
</tr>


<tr>
<td class="org-left">Austria</td>
<td class="org-right">97</td>
<td class="org-right">83858</td>
<td class="org-right">8169929</td>
</tr>


<tr>
<td class="org-left">Greece</td>
<td class="org-right">81</td>
<td class="org-right">131940</td>
<td class="org-right">11606813</td>
</tr>


<tr>
<td class="org-left">Ireland</td>
<td class="org-right">65</td>
<td class="org-right">70280</td>
<td class="org-right">4581269</td>
</tr>


<tr>
<td class="org-left">Sweden</td>
<td class="org-right">20</td>
<td class="org-right">449964</td>
<td class="org-right">9515744</td>
</tr>


<tr>
<td class="org-left">Finland</td>
<td class="org-right">16</td>
<td class="org-right">338424</td>
<td class="org-right">5410233</td>
</tr>


<tr>
<td class="org-left">Norway</td>
<td class="org-right">13</td>
<td class="org-right">385252</td>
<td class="org-right">5033675</td>
</tr>
</tbody>
</table>

    pop_t = np.dtype([('country', 'U20'), ('density', '=i4'), ('area', '=i4'), ('population', '=i4')])
    np.array(population, dtype=pop_t)

    array([('Netherlands', 393,  41526, 16928800),
           ('Belgium', 337,  30510, 11007020),
           ('United Kingdom', 256, 243610, 62262000),
           ('Germany', 233, 357021, 81799600),
           ('Liechtenstein', 205,    160,    32842),
           ('Italy', 192, 301230, 59715625),
           ('Switzerland', 177,  41290,  7301994),
           ('Luxembourg', 173,   2586,   512000),
           ('France', 111, 547030, 63601002),
           ('Austria',  97,  83858,  8169929),
           ('Greece',  81, 131940, 11606813),
           ('Ireland',  65,  70280,  4581269),
           ('Sweden',  20, 449964,  9515744),
           ('Finland',  16, 338424,  5410233),
           ('Norway',  13, 385252,  5033675)],
          dtype=[('country', '<U20'), ('density', '<i4'), ('area', '<i4'), ('population', '<i4')])


<a id="org120e0b2"></a>

## Endiannes

-   `<i8` use little-endian. x86 architecture and some Arm chips use this
    format.
-   `>i8` use big-endian. This format should be used when transmitting data over
    a network.
-   `=i8` use native-endiannes of the system. It is system-dependant, so
    shouldn&rsquo;t be use accross systems.

